<a href="https://colab.research.google.com/github/Saicharanchearla/B23_10i8/blob/main/29_08Lab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
data = [10,20,30,40,50]
series = pd.Series(data)

In [3]:
print(" Pandas Series:")
print(series)

 Pandas Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
#Series with custom Index
import pandas as pd

In [5]:
data = [10,20,30,40,50]
index_labels = ['a','b','c','d','e']

In [6]:
series = pd.Series(data,index=index_labels)

In [7]:
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [8]:
#Creating a data frame
import pandas as pd

In [10]:
data = {
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[25,30,35,40],
    'City':['Hyderabad','Hanamkonda','Warangal','Chennai']
}

In [11]:
df= pd.DataFrame(data)

In [12]:
print("Pandas DataFrame")
print(df)

Pandas DataFrame
      Name  Age        City
0    Alice   25   Hyderabad
1      Bob   30  Hanamkonda
2  Charlie   35    Warangal
3    David   40     Chennai

In [14]:
#(a)Accessing Data

#Access a single column
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [15]:
#Access multi columns
print(df[['Name','City']])

      Name        City
0    Alice   Hyderabad
1      Bob  Hanamkonda
2  Charlie    Warangal
3    David     Chennai

In [16]:
#Access rows using index
print(df.iloc[1])
print(df.loc[2])

Name           Bob
Age             30
City    Hanamkonda
Name: 1, dtype: object
Name     Charlie
Age           35
City    Warangal
Name: 2, dtype: object

In [17]:
#Adding a new column
df['Salary'] = [40000,50000,60000,70000]
print(df)

      Name  Age        City  Salary
0    Alice   25   Hyderabad   40000
1      Bob   30  Hanamkonda   50000
2  Charlie   35    Warangal   60000
3    David   40     Chennai   70000

In [18]:
#Removing a column
df = df.drop('City',axis=1)
print(df)

      Name  Age  Salary
0    Alice   25   40000
1      Bob   30   50000
2  Charlie   35   60000
3    David   40   70000

In [19]:
#(d) Filtering Data
# select roes where Age>30
print(df[df['Age']>30])

      Name  Age  Salary
2  Charlie   35   60000
3    David   40   70000

In [21]:
#(e) Basic Statistics
print(df['Age'].mean()) #average age
print(df['Age'].max()) #maximum age
print(df['Age'].min()) #minimum age

32.5
40
25

In [22]:
#5. Real world ex: Student data
import pandas as pd

In [24]:
#create a dataframe with stu details
student_data = {
    'Student_id': [4034,4033,1630,1036],
    'Name' : ['Rohith','Sai','Nithin','thonny'],
    'Marks': [85,90,78,92],
    'Department':['ECE','CSE','ECE','CSE']
}

In [28]:
df=pd.DataFrame(student_data)

In [27]:
print('Student Data:')
print(df)

Student Data:
   Student_id    Name  Marks Department
0        4034  Rohith     85        ECE
1        4033     Sai     90        CSE
2        1630  Nithin     78        ECE
3        1036  thonny     92        CSE